# Filling The Missing Data in the  Categorical Variables

In [1]:
import pandas as pd
import numpy as np
V1 = np.array([1,3,6,np.NaN,7,1,np.NaN,9,15])
V2 = np.array([7,np.NaN,5,8,12,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,12,5,6,14,7,np.NaN,2,31])
V4 = np.array(["IT",np.NaN,"HR","HR","HR","HR","HR","IT","IT"])

df = pd.DataFrame(
        {"Salary" : V1,
         "V2" : V2,
         "V3" : V3,
        "departmant" : V4}        
)

df

   Salary    V2    V3 departmant
0     1.0   7.0   NaN         IT
1     3.0   NaN  12.0        nan
2     6.0   5.0   5.0         HR
3     NaN   8.0   6.0         HR
4     7.0  12.0  14.0         HR
5     1.0   NaN   7.0         HR
6     NaN   NaN   NaN         HR
7     9.0   2.0   2.0         IT
8    15.0   3.0  31.0         IT

In [2]:
df.isnull()

   Salary     V2     V3  departmant
0   False  False   True       False
1   False   True  False       False
2   False  False  False       False
3    True  False  False       False
4   False  False  False       False
5   False   True  False       False
6    True   True   True       False
7   False  False  False       False
8   False  False  False       False

In [3]:
df.groupby("departmant")["departmant"].count()

departmant
HR     5
IT     3
nan    1
Name: departmant, dtype: int64

In [4]:
df.departmant.loc[df.departmant == "nan"] = "HR"

C:\Users\Dell\Anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [5]:
df

   Salary    V2    V3 departmant
0     1.0   7.0   NaN         IT
1     3.0   NaN  12.0         HR
2     6.0   5.0   5.0         HR
3     NaN   8.0   6.0         HR
4     7.0  12.0  14.0         HR
5     1.0   NaN   7.0         HR
6     NaN   NaN   NaN         HR
7     9.0   2.0   2.0         IT
8    15.0   3.0  31.0         IT

In [7]:
df["departmant"][0]=df["V3"][0]

C:\Users\Dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [8]:
df

   Salary    V2    V3 departmant
0     1.0   7.0   NaN        NaN
1     3.0   NaN  12.0         HR
2     6.0   5.0   5.0         HR
3     NaN   8.0   6.0         HR
4     7.0  12.0  14.0         HR
5     1.0   NaN   7.0         HR
6     NaN   NaN   NaN         HR
7     9.0   2.0   2.0         IT
8    15.0   3.0  31.0         IT

In [10]:
df.groupby("departmant")["departmant"].count()

departmant
HR    6
IT    2
Name: departmant, dtype: int64

In [12]:
df["departmant"].fillna(df["departmant"].mode())

0    HR
1    HR
2    HR
3    HR
4    HR
5    HR
6    HR
7    IT
8    IT
Name: departmant, dtype: object

* We filled in the missing data in the form of NaN in the department column using the mode of the observation values that exist in that column.

# Filling missing data in Time Series

In [14]:
import pandas as pd
import numpy as np
V1 = np.array([100,300,600,np.NaN,700,100,np.NaN,900,1500])
V2 = np.array([7,np.NaN,5,8,12,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,12,5,6,14,7,np.NaN,2,31])
V4 = np.array(["IT",np.NaN,"HR","HR","HR","HR","HR","IT","IT"])

df1 = pd.DataFrame(
        {"Salary" : V1,
         "V2" : V2,
         "V3" : V3,
        "Departmant" : V4}        
)

df1

   Salary    V2    V3 Departmant
0   100.0   7.0   NaN         IT
1   300.0   NaN  12.0        nan
2   600.0   5.0   5.0         HR
3     NaN   8.0   6.0         HR
4   700.0  12.0  14.0         HR
5   100.0   NaN   7.0         HR
6     NaN   NaN   NaN         HR
7   900.0   2.0   2.0         IT
8  1500.0   3.0  31.0         IT

**It would be wise;**

* 1-)to fill the missing data that will appear in the time series with either the previous or next data on a column basis.


* 2-)to fill the missing data with the average of the just before  value and  just after value of the missing data

In [17]:
df1["Salary"].interpolate() 
#fill the missing data with the average of the just before value and just after value of the missing data

#INDEX 3 AND INDEX 6 WERE MISSSING DATA BEFORE THE FIILING PROCESS

0     100.0
1     300.0
2     600.0
3     650.0
4     700.0
5     100.0
6     500.0
7     900.0
8    1500.0
Name: Salary, dtype: float64

In [19]:
df["Salary"].fillna(method = "bfill")

# fill the missing data that will appear in the time series with  next data on a column basis.

0     1.0
1     3.0
2     6.0
3     7.0
4     7.0
5     1.0
6     9.0
7     9.0
8    15.0
Name: Salary, dtype: float64